#+TODO: TODO | DONE
#+TODO: MUST-SEE | SAW
#+TODO: FAIL | GOAL DONE

* Planes

** Targets on Week

*** TODO =racket-mmanager=

*** TODO explore the =xetex=                                          :latex:

*** TODO see on the =org-store-link=                                    :org:

*** TODO explore the =which-function-mode=

*** TODO fix the =org-refile=                                           :org:

*** TODO Run the main file of the project in =run-command-reicpes= :run_command_recipes:

*** TODO explore the =org-speed-commands=                               :org:

*** TODO Make =LaTeX= document class for ГОСТ                         :latex:

*** TODO add support of the =org-export= to the =run-command-recipes= :run_command_recipes:

*** DONE CDLaTeX Math Modify for Russian imput method

*** TODO See notes without Emacs

*** TODO Print current buffer command for =fast-exec=

**** TODO More pretty =helm-projectile-files=

*** TODO Enable prettify mode in latex

*** TODO Change defnition of =insert-new-counter=

*** TODO Multicolumn expansion latex

*** TODO Latex expansion : wrapfig, wraptable
*** TODO Auto capitalize on #+TITLE in org
*** TODO Xenops in non \documentclass =LaTeX= documents
*** TODO Color Picker
*** TODO New =embrace= with support of the =smartparens=

*** TODO /spc spc v/ to insert string from kill ring
*** TODO Delete directories too in the =dired= via =SPC g=
*** TODO Impatient modes for all =major-modes=
*** TODO When "I am use" after insert description last uri
*** TODO Fix =my-copy-buffer-content-as-mipt-solution=
*** TODO View list of possible LaTeX expansion
*** TODO Fix coding
*** TODO Find /jwiegley/ way to refactor Emacs Lisp programs
*** TODO =paxedit-mode= for =racket-mode=
*** TODO More useful way to run =run-command-recipes= recipes

See on the compile command from the =latex-extra=
*** TODO Keybinding =SPC l z= for =peaxedit=
*** TODO ZMS PDF files should be names in special format

#+BEGIN_EXAMPLE
9_Иванов И._ЛФ-1.pdf
#+END_EXAMPLE
*** TODO Use =sp= instead of =paxedit= when can
*** TODO Fix the =LaTEX= section insertion
*** TODO New events for the =auto-save=
*** TODO Add units for =calc=
*** TODO Explore =calc=
*** TODO Fix =xah-fly-keys= in =calc=
*** TODO Map for =deft= integrated with =xah-fly-keys=
*** TODO Instead of /C-c '/ in indirected buffers use /SPC ;/
*** TODO Fix view of LaTeX formuls in the =org-mode=
*** TODO Fix modeline for =drag=
** Targets on Day

*** DONE Add \uline command for =LaTeX=
SCHEDULED: <2022-09-14 Ср>

*** explore the =org-publish=                                         :org:
SCHEDULED: <2022-09-14 Ср>

*** DONE explore the =org-export=                                     :org:
SCHEDULED: <2022-09-14 Ср>

Also use some themes for exporting to the =html=

*** DONE Complete a automatic management of the spaces to =LaTeX=
SCHEDULED: <2022-09-08 Чт>

- Add functions for declaring binary ops/parens
- Manage spaces for parens
- Manage spaces for all normal commands (argument and nonargument)
*** DONE =smartparens=
SCHEDULED: <2022-09-11 Вс>
*** TODO Fix autoloading of the =multiple-cursors=
  SCHEDULED: <2022-09-16 Пт>
* Films 

** MUST-SEE The Batman
   :PROPERTIES:
   :name:     Бэтмен
   :year:     2022
   :slogan:   Unmask The Truth
   :id:       590286
   :rating:   79.0
   :countries: (США)
   :END:

** MUST-SEE Sound of Metal
   :PROPERTIES:
   :name:     Звук металла
   :year:     2019
   :slogan:   Music was his world. Then silence revealed a new one.
   :id:       957883
   :rating:   73.0
   :countries: (Бельгия США)
   :END:

** MUST-SEE Missionary: Impossible
   :PROPERTIES:
   :name:     Миссия невыполнима
   :year:     2006
   :slogan:   nil
   :id:       305389
   :rating:   0
   :countries: (США)
   :END:

** MUST-SEE Thor: Love and Thunder
   :PROPERTIES:
   :name:     Тор: Любовь и гром
   :year:     2022
   :slogan:   Not every god has a plan.
   :id:       1282688
   :rating:   65.0
   :countries: (Австралия США)
   :END:

** MUST-SEE Doctor Strange in the Multiverse of Madness
   :PROPERTIES:
   :name:     Доктор Стрэндж: В мультивселенной безумия
   :year:     2022
   :slogan:   Enter a new dimension of Strange.
   :id:       1219909
   :rating:   67.0
   :countries: (США)
   :END:

** MUST-SEE The Matrix Reloaded
:PROPERTIES:
:name:     Матрица: Перезагрузка
:year:     2003
:slogan:   Одни машины помогают нам жить, другие – пытаются нас убить
:id:       299
:rating:   77.0
:countries: (США)
:END:

** MUST-SEE Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan
   :PROPERTIES:
   :name:     Борат
   :year:     2006
   :slogan:   Come to Kazakhstan, It's Nice!
   :id:       102474
   :rating:   67.0
   :countries: (Великобритания США)
   :END:

** MUST-SEE Raiders of the Lost Ark
:PROPERTIES:
:name:     Индиана Джонс: В поисках утраченного ковчега
:year:     1981
:slogan:   Indiana Jones - the new hero from the creators of JAWS and STAR WARS
:id:       339
:rating:   80.0
:countries: (США)
:END:



|           a | name | index |  an | 0     |
|-------------+------+-------+-----+-------|
| 4.5 + x / 4 |    2 |     4 |   6 | 6 + x |
|         4.5 |    9 |     0 |   8 | 6 + x |
|       205.5 |   90 |   300 | 431 | 6 + x |
#+TBLFM: $1=vmean($2..$5)::$5=6+x
